#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
//一维数组
// 类型说明符 数组名[常量表达式]
//例题 6.1 对10个数组元素依次赋值为 0，1，2，3，4，5，6，7，8，9 ，要求按逆序输出

//int main()
//{
//	int i, a[10];
//	for (i = 0; i <= 9; i++)//对数组元素a[0]~a[9]赋值
//		a[i] = i;
//	for (i = 9; i >= 0; i--)//输出a[9]~a[0]共10个数组元素
//		printf("%d ", a[i]);
//	printf("\n");
//	return 0;
//}

//二维数组
// 类型说明符 数组名[常量表达式][常量表达式]
//例如	float a[3,4] 定义a为3行4列的数组
// 
//例6.4 将一个二维数组行和列的元素互换 存到另一个二维数组中
//    例:  a={{1,2,3},{4,5,6}}  b={{1,4},{2,5},{3,6}}

//int main()
//{
//	int a[2][3] = { {1,2,3},{4,5,6} };
//	int b[3][2], i, j;
//	printf("array a:\n");
//	for (i = 0; i <= 1; i++)		//处理a数组中的一行中各元素
//	{
//		for (j = 0; j <= 2; j++)	//处理a数组中某一列中各元素
//		{
//			printf("%5d", a[i][j]); //输出a数组中的一个元素
//			b[j][i] = a[i][j];		//将a数组元素的值赋给b数组相对应元素
//		}
//		printf("\n");
//	}
//	printf("array b:\n");			//输出b数组各元素
//	for (i = 0; i <= 2; i++)		//处理b数组中一行中各元素
//	{
//		for (j = 0; j <= 1; j++)	//处理b数组中一列中各元素
//			printf("%5d", b[i][j]);	//输出b数组的一个元素
//		printf("\n");
//	}
//	return 0;
//}

//例 6.7
int main()
{
	char diamond[][5] = { {' ',',' * '},{' ',' * ',' ',' * '},{' * ',' ',' ',' ',' * '},
	{' ','*',' ','*'},{' ',' ','*'}};
	int i, j;
	for (i = 0; i < 5; i++)
	{
		for (j = 0; j < 5; j++)
			printf("%c", diamond[i][j]);
		printf("\n");
	}
	return 0;
}